{"title":"","uid":"f73a8e23e6f6f669cf99c7dba8fa0722","slug":"RPC framework","date":"2023-03-07T16:55:23.699Z","updated":"2022-03-07T09:02:28.000Z","comments":true,"path":"api/articles/RPC framework.json","keywords":null,"cover":null,"content":"<h1 id=\"Remote-Procedure-Call-RPC\"><a href=\"#Remote-Procedure-Call-RPC\" class=\"headerlink\" title=\"Remote Procedure Call (RPC)\"></a>Remote Procedure Call (RPC)</h1><h3 id=\"What-is-Remote-Procedure-Call-RPC\"><a href=\"#What-is-Remote-Procedure-Call-RPC\" class=\"headerlink\" title=\"What is Remote Procedure Call (RPC)?\"></a>What is Remote Procedure Call (RPC)?</h3><p>Remote Procedure Call is a software communication protocol that one program can use to request a service from a program located in another computer on a network without having to understand the network’s details. RPC is used to call other processes on the remote systems like a local system. A procedure call is also sometimes known as a <em>function call</em> or a <em>subroutine call</em>.</p>\n<p>RPC uses the client-server model. The requesting program is a client, and the service-providing program is the server. Like a local procedure call, an RPC is a synchronous operation requiring the requesting program to be suspended until the results of the remote procedure are returned. However, the use of lightweight processes or threads that share the same address space enables multiple RPCs to be performed concurrently.</p>\n<p>The interface definition language (IDL) – the specification language used to describe a software component’s application programming interface (API) – is commonly used in Remote Procedure Call software. In this case, IDL provides a bridge between the machines at either end of the link that may be using different operating systems (OSes) and computer languages.</p>\n<h3 id=\"What-does-RPC-do\"><a href=\"#What-does-RPC-do\" class=\"headerlink\" title=\"What does RPC do?\"></a>What does RPC do?</h3><p>When program statements that use the RPC framework are compiled into an executable program, a stub is included in the compiled code that acts as the representative of the remote procedure code. When the program is run and the procedure call is issued, the stub receives the request and forwards it to a client runtime program in the local computer. The first time the client stub is invoked, it contacts a name server to determine the transport address where the server resides.</p>\n<p>The client runtime program has the knowledge of how to address the remote computer and server application and sends the message across the network that requests the remote procedure. Similarly, the server includes a runtime program and stub that interface with the remote procedure itself. Response-request protocols are returned the same way.</p>\n<h3 id=\"How-does-RPC-work\"><a href=\"#How-does-RPC-work\" class=\"headerlink\" title=\"How does RPC work?\"></a>How does RPC work?</h3><p>When a remote procedure call is invoked, the calling environment is suspended, the procedure parameters are transferred across the network to the environment where the procedure is to execute, and the procedure is then executed in that environment.</p>\n<p>When the procedure finishes, the results are transferred back to the calling environment, where execution resumes as if returning from a regular procedure call.</p>\n<p>During an RPC, the following steps take place:</p>\n<ol>\n<li>The client calls the client stub. The call is a local procedure call with parameters pushed onto the stack in the normal way.</li>\n<li>The client stub packs the procedure parameters into a message and makes a system call to send the message. The packing of the procedure parameters is called marshalling.</li>\n<li>The client’s local OS sends the message from the client machine to the remote server machine.</li>\n<li>The server OS passes the incoming packets to the server stub.</li>\n<li>The server stub unpacks the parameters – called <em>unmarshalling</em> – from the message.</li>\n<li>When the server procedure is finished, it returns to the server stub, which marshals the return values into a message. The server stub then hands the message to the transport layer.</li>\n<li>The transport layer sends the resulting message back to the client transport layer, which hands the message back to the client stub.</li>\n<li>The client stub unmarshalls the return parameters, and execution returns to the caller.</li>\n</ol>\n<h3 id=\"Types-of-RPC\"><a href=\"#Types-of-RPC\" class=\"headerlink\" title=\"Types of RPC\"></a>Types of RPC</h3><p>There are several RPC models and distributed computing implementations. A popular model and implementation is the Open Software Foundation’s (OSF) Distributed Computing Environment (DCE). The Institute of Electrical and Electronics Engineers (IEEE) defines RPC in its ISO Remote Procedure Call Specification, ISO/IEC CD 11578 N6561, ISO/IEC, November 1991.</p>\n<p>Examples of RPC configurations include the following:</p>\n<ul>\n<li>The normal method of operation where the client makes a call and doesn’t continue until the server returns the reply.</li>\n<li>The client makes a call and continues with its own processing. The server doesn’t reply.</li>\n<li>A facility for sending several client nonblocking calls in one batch.</li>\n<li>RPC clients have a broadcast facility, i.e., they can send messages to many servers and then receive all the resulting replies.</li>\n<li>The client makes a nonblocking client/server call; the server signals the call is completed by calling a procedure associated with the client.</li>\n</ul>\n<p>RPC spans the transport layer and the application layer in the Open Systems Interconnection (OSI) model of network communication. RPC makes it easier to develop an application that includes multiple programs distributed in a network. Alternative methods for client-server communication include message queueing and IBM’s Advanced Program-to-Program Communication (APPC).</p>\n<h3 id=\"Pros-and-cons-of-RPC\"><a href=\"#Pros-and-cons-of-RPC\" class=\"headerlink\" title=\"Pros and cons of RPC\"></a>Pros and cons of RPC</h3><p>Though it boasts a wide range of benefits, there are certainly a share of pitfalls that those who use RPC should be aware of.</p>\n<p>Here are some of the advantages RPC provides for developers and application managers:</p>\n<ul>\n<li>Helps clients communicate with servers via the traditional use of procedure calls in high-level languages.</li>\n<li>Can be used in a distributed environment, as well as the local environment.</li>\n<li>Supports process-oriented and thread-oriented models.</li>\n<li>Hides the internal message-passing mechanism from the user.</li>\n<li>Requires only minimal effort to rewrite and redevelop the code.</li>\n<li>Provides abstraction, i.e., the message-passing nature of network communication is hidden from the user.</li>\n<li>Omits many of the protocol layers to improve performance.</li>\n</ul>\n<p>On the other hand, some of the disadvantages of RPC include the following:</p>\n<ul>\n<li>The client and server use different execution environments for their respective routines, and the use of resources (e.g., files) is also more complex. Consequently, RPC systems aren’t always suited for transferring large amounts of data.</li>\n<li>RPC is highly vulnerable to failure because it involves a communication system, another machine and another process.</li>\n<li>There is no uniform standard for RPC; it can be implemented in a variety of ways.</li>\n<li>RPC is only interaction-based, and as such, it doesn’t offer any flexibility when it comes to hardware architecture.</li>\n</ul>\n<p><a href=\"https://www.techtarget.com/searchapparchitecture/definition/Remote-Procedure-Call-RPC\">What Is Remote Procedure Call (RPC)? Definition from SearchAppArchitecture (techtarget.com)</a></p>\n<p><a href=\"https://zhuanlan.zhihu.com/p/187560185\">RPC是什么，看完你就知道了 - 知乎 (zhihu.com)</a></p>\n","text":"Remote Procedure Call (RPC)What is Remote Procedure Call (RPC)?Remote Procedure Call is a software communication protocol that one program c...","link":"","photos":[],"count_time":{"symbolsCount":"6.3k","symbolsTime":"6 mins."},"categories":[],"tags":[],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Remote-Procedure-Call-RPC\"><span class=\"toc-text\">Remote Procedure Call (RPC)</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#What-is-Remote-Procedure-Call-RPC\"><span class=\"toc-text\">What is Remote Procedure Call (RPC)?</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#What-does-RPC-do\"><span class=\"toc-text\">What does RPC do?</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#How-does-RPC-work\"><span class=\"toc-text\">How does RPC work?</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Types-of-RPC\"><span class=\"toc-text\">Types of RPC</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Pros-and-cons-of-RPC\"><span class=\"toc-text\">Pros and cons of RPC</span></a></li></ol></li></ol></li></ol>","author":{"name":"JBR_Bunjie","slug":"blog-author","avatar":"https://avatars.githubusercontent.com/u/90251718?v=4","link":"/","description":"仿生程序员会在光环上遇见AI乐正绫吗？","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"bilibili":{"icon":"/svg/bilibili-fill.svg","link":"https://space.bilibili.com/415377461"},"github":{"icon":"/svg/social_github.svg","link":"https://github.com/JBR-Bunjie"}}}},"mapped":true,"prev_post":{"title":"","uid":"f73a8e23e6f6f669cf99c7dba8fa0722","slug":"Complexity Has to Live Somewhere","date":"2023-03-07T16:55:26.468Z","updated":"2022-03-01T10:21:30.000Z","comments":true,"path":"api/articles/Complexity Has to Live Somewhere.json","keywords":null,"cover":null,"text":"Original Post: Complexity Has to Live Somewhere (ferd.ca) Chinese Version: Complexity Has to Live Somewhere - Google 文档 架构设计-复杂度是不灭的 - 知乎 (z...","link":"","photos":[],"count_time":{"symbolsCount":"1.5k","symbolsTime":"1 mins."},"categories":[],"tags":[],"author":{"name":"JBR_Bunjie","slug":"blog-author","avatar":"https://avatars.githubusercontent.com/u/90251718?v=4","link":"/","description":"仿生程序员会在光环上遇见AI乐正绫吗？","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"bilibili":{"icon":"/svg/bilibili-fill.svg","link":"https://space.bilibili.com/415377461"},"github":{"icon":"/svg/social_github.svg","link":"https://github.com/JBR-Bunjie"}}}}},"next_post":{"title":"","uid":"f73a8e23e6f6f669cf99c7dba8fa0722","slug":"为你的github项目新建一个doc页面","date":"2023-03-07T16:55:23.696Z","updated":"2021-09-21T09:49:04.000Z","comments":true,"path":"api/articles/为你的github项目新建一个doc页面.json","keywords":null,"cover":null,"text":"示例： xlwings - Make Excel Fly! — xlwings dev documentation 用Github Page快速创建项目文档网站 - 知乎 (zhihu.com) Your awesome title · Write an awesome desc...","link":"","photos":[],"count_time":{"symbolsCount":191,"symbolsTime":"1 mins."},"categories":[],"tags":[],"author":{"name":"JBR_Bunjie","slug":"blog-author","avatar":"https://avatars.githubusercontent.com/u/90251718?v=4","link":"/","description":"仿生程序员会在光环上遇见AI乐正绫吗？","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"bilibili":{"icon":"/svg/bilibili-fill.svg","link":"https://space.bilibili.com/415377461"},"github":{"icon":"/svg/social_github.svg","link":"https://github.com/JBR-Bunjie"}}}}}}